test/data/test-spirometri.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:kron="http://kroniker.service.kihdb.silverbullet.dk/" xmlns:urn="urn:oio:medcom:chronic-dataset:1.0.0" xmlns:ns="http://rep.oio.dk/medcom.dk/xml/schemas/2011/06/20/">
    <soapenv:Header/>
    <soapenv:Body>
        <kron:UploadChronicDataset>
            <!--Optional:-->
            <urn:UploadChronicDatasetRequestMessage>
                <ns:MedComKD>
                    <ns:Borger>
                        <ns:CPR>2512484916</ns:CPR>
                        <ns:Fornavn>Nancy</ns:Fornavn>
                        <ns:Efternavn>Berggren</ns:Efternavn>
                        <ns:FoedselsDato>1948-12-25</ns:FoedselsDato>
                        <ns:Koen>K</ns:Koen>
                        <ns:Vej>Skovvejen 12</ns:Vej>
                        <ns:Postnummer>8010</ns:Postnummer>
                        <ns:By>Aarhus N</ns:By>
                        <ns:Kontakttelefon>86121824</ns:Kontakttelefon>
                        <ns:eMail>nb@meail.dk</ns:eMail>
                    </ns:Borger>
                    <ns:MonitoreringOgMaal>
                        <!--Zero or more repetitions:-->
                        <ns:Spirometri>
                            <ns:ID>1</ns:ID>
                            <ns:Dato>2010-11-28T12:33:00</ns:Dato>
                            <ns:AnalyseID>fisk</ns:AnalyseID>
                            <ns:FEV1>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1>
                            <ns:FVC>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FVC>
                            <ns:FEV1FVCRatio>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1FVCRatio>
                            <ns:FEV1Pct>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1Pct>
                            <ns:UdfoertAf>svend</ns:UdfoertAf>
                        </ns:Spirometri>
                        <ns:Spirometri>
                            <ns:ID>1</ns:ID>
                            <ns:Dato>2010-11-28T12:33:00</ns:Dato>
                            <ns:AnalyseID>fisk</ns:AnalyseID>
                            <ns:FEV1>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1>
                            <ns:FVC>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FVC>
                            <ns:FEV1FVCRatio>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1FVCRatio>
                            <ns:FEV1Pct>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1Pct>
                            <ns:UdfoertAf>svend</ns:UdfoertAf>
                        </ns:Spirometri>
                        <ns:Spirometri>
                            <ns:ID>1</ns:ID>
                            <ns:Dato>2010-11-28T12:33:00</ns:Dato>
                            <ns:AnalyseID>fisk</ns:AnalyseID>
                            <ns:FEV1>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1>
                            <ns:FVC>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FVC>
                            <ns:FEV1FVCRatio>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1FVCRatio>
                            <ns:FEV1Pct>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1Pct>
                            <ns:UdfoertAf>svend</ns:UdfoertAf>
                        </ns:Spirometri>
                        <ns:Spirometri>
                            <ns:ID>1</ns:ID>
                            <ns:Dato>2010-11-28T12:33:00</ns:Dato>
                            <ns:AnalyseID>fisk</ns:AnalyseID>
                            <ns:FEV1>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1>
                            <ns:FVC>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FVC>
                            <ns:FEV1FVCRatio>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1FVCRatio>
                            <ns:FEV1Pct>
                                <ns:IUPAC>test</ns:IUPAC>
                                <ns:Analyse>test</ns:Analyse>
                                <ns:Resultat>2</ns:Resultat>
                                <ns:Enhed>kg</ns:Enhed>
                                <!--Optional:-->
                                <ns:Min>1</ns:Min>
                                <!--Optional:-->
                                <ns:Max>10</ns:Max>
                                <!--Optional:-->
                                <ns:Abnorm>20</ns:Abnorm>
                                <!--Optional:-->
                                <ns:PatientensMaal>20,1</ns:PatientensMaal>
                            </ns:FEV1Pct>
                            <ns:UdfoertAf>svend</ns:UdfoertAf>
                        </ns:Spirometri>
                    </ns:MonitoreringOgMaal>
                </ns:MedComKD>
            </urn:UploadChronicDatasetRequestMessage>
        </kron:UploadChronicDataset>
    </soapenv:Body>
</soapenv:Envelope>